app/controllers/events_controller.rb

  def create
    service = EventService.new(event_params)

    service.create
---
INSERT INTO "events" ("action", "issue_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["action", "create"], ["issue_id", 1], ["created_at", "2018-05-23 16:44:59.421663"], ["updated_at", "2018-05-23 16:44:59.421663"]]

    def load_issue
      @issue = Issue.find(params[:id])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]